The Insight Filter (WHERE & GROUP BY)
Goal: Filter noise and summarize data at the database level.
Instructions:
Filter: Write a query to find all interns in the 'Data Science' track who have a stipend greater than 5000.
Aggregate: Use GROUP BY to find the average stipend for each track.
Count: Count how many interns are in each track.
Why: Performing calculations inside the database is often much faster than loading all data into Python and doing the math there.

In [14]:
import sqlite3
import pandas as pd

In [15]:
conn = sqlite3.connect("internship.db")

In [16]:
df_filter = pd.read_sql_query("""
SELECT *
FROM interns
WHERE track = 'Data Science'
AND stipend > 5000;
""", conn)

df_filter

   id     name         track  stipend
0   1  Archana  Data Science    15000
1   4    Kiran  Data Science    16000

In [17]:
df_avg = pd.read_sql_query("""
SELECT track, AVG(stipend) AS average_stipend
FROM interns
GROUP BY track;
""", conn)

df_avg

          track  average_stipend
0         AI/ML          18000.0
1  Data Science          15500.0
2       Web Dev          12500.0

In [18]:
df_count = pd.read_sql_query("""
SELECT track, COUNT(*) AS total_interns
FROM interns
GROUP BY track;
""", conn)

df_count

          track  total_interns
0         AI/ML              1
1  Data Science              2
2       Web Dev              2

In [19]:
conn.close()